AUTO_config_TK_pesok/src/DocumentJournals/ТК_ЗаказыПокупателей/ТК_ЗаказыПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ТК_ЗаказыПокупателей</name>
  <registeredDocuments>Document.ЗаказПокупателя</registeredDocuments>
  <columns>
    <name>Автор</name>
  </columns>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Контрагент</name>
  </columns>
  <columns>
    <name>Договор</name>
  </columns>
  <columns>
    <name>АдресДоставки</name>
  </columns>
  <columns>
    <name>РегламентированныйУчет</name>
  </columns>
  <columns>
    <name>Склад</name>
  </columns>
  <columns>
    <name>СрокПоставки</name>
  </columns>
</mdclass:DocumentJournal>

AUTO_config_TK_pesok/src/AccumulationRegisters/РезервыТоваров/РезервыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТоваров</name>
  <resources>
    <name>Резерв</name>
    <comment>Количество зарезервированного товара на складе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <comment>Склад компании</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <comment>Характеристика номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <comment>Документ оформления Резерва</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_ПараметрыОбменаEDI/ТК_ПараметрыОбменаEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ПараметрыОбменаEDI</name>
  <resources>
    <name>УчетнаяЗаписьEDI</name>
    <type>
      <types>CatalogRef.ТК_УчетныеЗаписиEDI</types>
    </type>
  </resources>
  <resources>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИсходящаяРеализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПоступлениеТоваров</name>
    <comment>Отправка приходов (COMDOC)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЗаказИзПрихода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПротоколыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПодтверждениеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПоИнвентаризации</name>
    <comment>INVRPT</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_ОчередьНаСборкуРезервов/ТК_ОчередьНаСборкуРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ОчередьНаСборкуРезервов</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыСборки</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСборкиРезервов</types>
    </type>
  </resources>
  <resources>
    <name>НачалоСборки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КонецСборки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СотрудникКонтроля</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>НачалоКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КонецКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Упаковщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ДопСборщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РезервированиеЗаказовПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_СостояниеДокументов/ТК_СостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_СостояниеДокументов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыСборкиРезервов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DefinedType.ОбъектыСоСтатусами</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Documents/РезервированиеЗаказовПокупателя/РезервированиеЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезервированиеЗаказовПокупателя</name>
  <comment>Резервирование заказов покупателя</comment>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.РезервыТоваров</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>Адрес доставки для использования в печатных формах (оставлен для совместимости)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Резервируемые товары</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар,услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоРазмещения</name>
      <comment>Склад компании, на котором резервируется номенклатура по заказу покупателя.</comment>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <comment>Резервируемый заказ покупателя</comment>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеОтгрузки</name>
    <comment>Распределение отгрузки по заказам покупателей</comment>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/КорректировкаЗаказаПокупателя/КорректировкаЗаказаПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаЗаказаПокупателя</name>
  <comment>Корректировка заказа покупателя</comment>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.РезервыТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/Маршруты/Маршруты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Маршруты</name>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автотранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DocumentJournals/ТК_ЗаказыПокупателей/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(НачПериода)
		Или Не ЗначениеЗаполнено(КонПериода) Тогда
		КонПериода = КонецДня(ТекущаяДата());
		НачПериода = НачалоДня(КонПериода)-24*60*60;
	КонецЕсли;
	
	
	УстановитьОтборДинамическихСписков();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанель;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект,ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 0;
	нСтатус.Статус  = "Все";
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 1;
	нСтатус.Статус  = "Необработанные";
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 2;
	нСтатус.Статус  = "Не в ТТН";
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 3;
	нСтатус.Статус  = "Неотгруженные";
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 4;
	нСтатус.Статус  = "Отгруженные";
	
	ЗаполнитьСписокВыбораПечатныхФорм(Элементы.Печать_ПФ_Резервирование.СписокВыбора, "РезервированиеЗаказовПокупателя");
	ЗаполнитьСписокВыбораПечатныхФорм(Элементы.Печать_ПФ_Реализация.СписокВыбора, "РеализацияТоваров");
	ЗаполнитьСписокВыбораПечатныхФорм(Элементы.Печать_ПФ_Перемещение.СписокВыбора, "ПеремещениеТоваров");
	ЗаполнитьСписокВыбораПечатныхФорм(Элементы.Печать_ПФ_Реализация_ФС.СписокВыбора, "РеализацияТоваров");
	ЗаполнитьСписокВыбораПечатныхФорм(Элементы.Печать_ПФ_ТТН_ФС.СписокВыбора, "РеализацияТоваров");
	ЗаполнитьСписокВыбораПечатныхФорм(Элементы.Печать_ПФ_Декларация_ФС.СписокВыбора, "РеализацияТоваров");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// Востанавливаем настройки быстрых фильтров
	Если СохраненныйСтатус > 0 Тогда 
		ЭтаФорма.Элементы.СписокСтатусов.ТекущаяСтрока = СохраненныйСтатус; 
	КонецЕсли;
	
	
	//Настройки по умолчанию
	Если ПустаяСтрока(Печать_ПФ_Реализация) Тогда 
		Печать_ПФ_Реализация = "РасходнаяНакладная";		
	КонецЕсли;
	
	Если ПустаяСтрока(Печать_ПФ_Резервирование) Тогда 
		Печать_ПФ_Резервирование = "РезервированиеЗаказовПоМаршруту";		
	КонецЕсли;
	
	Если ПустаяСтрока(Печать_ПФ_Перемещение) Тогда 
		Печать_ПФ_Перемещение = "ПеремещениеТоваров";
	КонецЕсли;
	
	Если ПустаяСтрока(Печать_ПФ_Реализация_ФС) Тогда 
		Печать_ПФ_Реализация_ФС = "РасходнаяНакладнаяФС";		
	КонецЕсли;
	
	Если ПустаяСтрока(Печать_ПФ_Декларация_ФС) Тогда 
		Печать_ПФ_Декларация_ФС = "ДекларацияПроизводителя";		
	КонецЕсли;
	
	Если ПустаяСтрока(Печать_ПФ_ТТН_ФС) Тогда 
		Печать_ПФ_ТТН_ФС = "ТТН_ФС";		
	КонецЕсли;
	
	
КонецПроцедуры



&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораПечатныхФорм(СписокВыбора, ИмяОбъектаМетаданных)
	
	СписокВыбора.Очистить();
	
	ОбъектМетаданных = Метаданные.Документы[ИмяОбъектаМетаданных];
	ТаблицаПечатныхФорм = УправлениеПечатью.КомандыПечатиОбъекта(ОбъектМетаданных);
	
	Для Каждого Стр Из ТаблицаПечатныхФорм Цикл 
		Если Стр.Отключена Тогда 
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(Стр.Идентификатор, Стр.Представление);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Если НачПериода > КонПериода И ЗначениеЗаполнено(КонПериода) Тогда
		НачПериода = КонПериода;
	КонецЕсли;
	
	ПериодПриИзмененииНаСервере();
	
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Если КонПериода < НачПериода И ЗначениеЗаполнено(КонПериода) Тогда
		КонПериода = НачПериода;
	КонецЕсли;
	
	ПериодПриИзмененииНаСервере();
	
	
КонецПроцедуры




&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	УстановитьОтборДинамическихСписков();
	
	//	ОбновитьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	Список.Параметры.УстановитьЗначениеПараметра("НачПериода", НачПериода);
	Список.Параметры.УстановитьЗначениеПараметра("КонПериода", ?(ЗначениеЗаполнено(КонПериода), КонецДня(КонПериода), КонПериода));
	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("Организация", ОрганизацияОтбор));	
КонецПроцедуры

&НаКлиенте
Процедура СкладОтборПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("Склад", СкладОтбор));	
КонецПроцедуры




#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	
	Для Каждого текОтбор Из ПараметрыОтбора Цикл 		
		ИмяРеквизита = текОтбор.Ключ;
		Значение = текОтбор.Значение;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		ИмяРеквизита, 
		Значение, 
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ЗначениеЗаполнено(Значение));
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



#КонецОбласти


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодключитьОбработчикОжидания("ПересчитатьВыделенныеСтроки", 0.3, Истина);
КонецПроцедуры


&НаСервере
Функция ЗапросНайтиПодчиненныйПоТипу(Знач ДокСсылка,Знач ТипДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст =     "ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка КАК ДокСсылка,
	|	ВЫБОР
	|		КОГДА СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"
	|			ТОГДА ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ."+ТипДокумента+").ПометкаУдаления
	|	КОНЕЦ КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"
	|			ТОГДА ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ."+ТипДокумента+").Проведен
	|	КОНЕЦ КАК Проведен
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"";
	Запрос.УстановитьПараметр("Док",ДокСсылка);
	
	Возврат Запрос;
	
КонецФункции


&НаСервере
Процедура СформироватьРезерв(Заказы)
	
	ОбъединениеРезервов = ТипЗнч(Заказы) = Тип("Массив");
	
	РезервыПорцииЗаказов = Новый Массив;
	
	Если ОбъединениеРезервов Тогда
		Для Каждого СтрЗаказ Из Заказы Цикл 
			Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ,"РезервированиеЗаказовПокупателя");
			Рез = Запрос.Выполнить();
			Если НЕ Рез.Пустой() Тогда
				ВыборкаРезерв = Рез.Выбрать();
				Пока ВыборкаРезерв.Следующий() Цикл
					РезервыПорцииЗаказов.Добавить(ВыборкаРезерв.ДокСсылка);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Запрос = ЗапросНайтиПодчиненныйПоТипу(Заказы,"РезервированиеЗаказовПокупателя");
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			ВыборкаРезерв = Рез.Выбрать();
			Пока ВыборкаРезерв.Следующий() Цикл
				РезервыПорцииЗаказов.Добавить(ВыборкаРезерв.ДокСсылка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоРезервыПорцииЗаказов = РезервыПорцииЗаказов.Количество();
	Если КоличествоРезервыПорцииЗаказов = 0 Тогда
		дОбъектРезерв = Документы.РезервированиеЗаказовПокупателя.СоздатьДокумент();
	Иначе
		Для Индекс = 0 по РезервыПорцииЗаказов.ВГраница() Цикл 
			Если Индекс = РезервыПорцииЗаказов.ВГраница() Тогда
				дОбъектРезерв = РезервыПорцииЗаказов[Индекс].ПолучитьОбъект();
				Если дОбъектРезерв.Проведен Тогда
					дОбъектРезерв.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ИначеЕсли дОбъектРезерв.ПометкаУдаления Тогда
					дОбъектРезерв.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
			Иначе
				Если НЕ РезервыПорцииЗаказов[Индекс].ПометкаУдаления Тогда
					дОбъектРезерв = РезервыПорцииЗаказов[Индекс].ПолучитьОбъект();
					дОбъектРезерв.УстановитьПометкуУдаления(Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	дОбъектРезерв.Заполнить(Заказы);	
	дОбъектРезерв.Дата = ТекущаяДатаСеанса();
	Если дОбъектРезерв.ЭтоНовый() Тогда
		дОбъектРезерв.УстановитьНовыйНомер();
	КонецЕсли;
	
	ОбработкаТабличнойЧастиСервер.СортироватьТЧ(дОбъектРезерв.Товары);
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад",дОбъектРезерв.СкладКомпании);
	ЭлементБлокировки.ИсточникДанных  =  дОбъектРезерв.Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();
	
	Документы.РезервированиеЗаказовПокупателя.УдалитьСтрокиБезОстатка(дОбъектРезерв);
	Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
	Документы.РезервированиеЗаказовПокупателя.ЗаполнитьХарактеристикиПоОстаткамПартий(дОбъектРезерв);
	//Проверим квоты после заполнения характеристик, может быть еще уменьшено кол-во
	Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
	
	Если дОбъектРезерв.Товары.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;		
	
	//тзЗаказыПокупателей = дОбъектРезерв.Товары.Выгрузить(,"ЗаказПокупателя");//.Скопировать(,"ЗаказПокупателя");
	//тзЗаказыПокупателей.Свернуть("ЗаказПокупателя");
	//Для Каждого СтрЗаказ Из тзЗаказыПокупателей Цикл
	//	стр = дОбъектРезерв.РаспределениеОтгрузки.Добавить();
	//	ЗаполнитьЗначенияСвойств(стр,СтрЗаказ);
	//КонецЦикла;
	
	дОбъектРезерв.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
	
	ЗафиксироватьТранзакцию();
	
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура РезервироватьМассивСписка(МассивИзСписка)
	
	
	
	//// проверка на отгрузку
	//Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрокаСписка,?(ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(СтрокаСписка.Контрагент),"ПеремещениеТоваров","РеализацияТоваров"));
	//Рез = Запрос.Выполнить();
	//
	//Если Не Рез.Пустой() Тогда
	//	Выборка = Рез.Выбрать();
	//	Выборка.Следующий();
	//	Если Выборка.Проведен Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка.СкладКомпании КАК СкладКомпании,
	|	ЕСТЬNULL(ДополнительныеСведения.Значение, ЛОЖЬ) КАК Попачка,
	|	ЗаказПокупателя.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Ссылка.ТочкаДоставки КАК ТочкаДоставки,
	|	ЗаказПокупателя.Ссылка КАК Заказ,
	|	НЕ ТК_ПараметрыОбменаEDI.Контрагент ЕСТЬ NULL КАК EDI
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ЗаказПокупателя.Ссылка = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Имя = ""Попачечно_b9a6d6a63dc74ae1a8f7d6a75ea25654"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ПараметрыОбменаEDI КАК ТК_ПараметрыОбменаEDI
	|		ПО ЗаказПокупателя.Контрагент = ТК_ПараметрыОбменаEDI.Контрагент
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	СкладКомпании,
	|	Попачка,
	|	Контрагент,
	|	ТочкаДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", МассивИзСписка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//	РезультатЗапроса.Выгрузить()
	
	ВыборкаСкладКомпании = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСкладКомпании.Следующий() Цикл
		// Вставить обработку выборки ВыборкаСкладКомпании
		
		ВыборкаПопачка = ВыборкаСкладКомпании.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПопачка.Следующий() Цикл
			// Вставить обработку выборки ВыборкаПопачка
			
			ВыборкаКонтрагент = ВыборкаПопачка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКонтрагент.Следующий() Цикл
				// Вставить обработку выборки ВыборкаКонтрагент
				
				ВыборкаТочкаДоставки = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаТочкаДоставки.Следующий() Цикл
					// Вставить обработку выборки ВыборкаТочкаДоставки
					
					ПорцияЗаказов = Новый Массив;
					ВыборкаДетальныеЗаписи = ВыборкаТочкаДоставки.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						Если ВыборкаДетальныеЗаписи.EDI Тогда
							СформироватьРезерв(ВыборкаДетальныеЗаписи.Заказ);
						Иначе
							ПорцияЗаказов.Добавить(ВыборкаДетальныеЗаписи.Заказ);
						КонецЕсли;
					КонецЦикла;
					
					Если ПорцияЗаказов.Количество() > 0 Тогда
						СформироватьРезерв(ПорцияЗаказов);
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Процедура РезервироватьМассивСписка1(МассивИзСписка)
	
	
	
	//// проверка на отгрузку
	//Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрокаСписка,?(ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(СтрокаСписка.Контрагент),"ПеремещениеТоваров","РеализацияТоваров"));
	//Рез = Запрос.Выполнить();
	//
	//Если Не Рез.Пустой() Тогда
	//	Выборка = Рез.Выбрать();
	//	Выборка.Следующий();
	//	Если Выборка.Проведен Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка.СкладКомпании КАК СкладКомпании,
	|	ЕСТЬNULL(ДополнительныеСведения.Значение, ЛОЖЬ) КАК Попачка,
	|	ЗаказПокупателя.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Ссылка.ТочкаДоставки КАК ТочкаДоставки,
	|	ЗаказПокупателя.Ссылка КАК Заказ,
	|	ВЫБОР
	|		КОГДА ТК_ПараметрыОбменаEDI.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК EDI
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ЗаказПокупателя.Ссылка = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Имя = ""Попачечно_b9a6d6a63dc74ae1a8f7d6a75ea25654"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ПараметрыОбменаEDI КАК ТК_ПараметрыОбменаEDI
	|		ПО ЗаказПокупателя.Контрагент = ТК_ПараметрыОбменаEDI.Контрагент
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	СкладКомпании,
	|	Попачка,
	|	Контрагент,
	|	ТочкаДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", МассивИзСписка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//	РезультатЗапроса.Выгрузить()
	
	ВыборкаСкладКомпании = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСкладКомпании.Следующий() Цикл
		// Вставить обработку выборки ВыборкаСкладКомпании
		
		ВыборкаПопачка = ВыборкаСкладКомпании.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПопачка.Следующий() Цикл
			// Вставить обработку выборки ВыборкаПопачка
			
			ВыборкаКонтрагент = ВыборкаПопачка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКонтрагент.Следующий() Цикл
				// Вставить обработку выборки ВыборкаКонтрагент
				
				ВыборкаТочкаДоставки = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаТочкаДоставки.Следующий() Цикл
					// Вставить обработку выборки ВыборкаТочкаДоставки
					
					ПорцияЗаказов = Новый Массив;
					ВыборкаДетальныеЗаписи = ВыборкаТочкаДоставки.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						ПорцияЗаказов.Добавить(ВыборкаДетальныеЗаписи.Заказ);
					КонецЦикла;
					
					РезервыПорцииЗаказов = Новый Массив;
					
					Для Каждого СтрЗаказ Из ПорцияЗаказов Цикл 
						Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ,"РезервированиеЗаказовПокупателя");
						Рез = Запрос.Выполнить();
						Если НЕ Рез.Пустой() Тогда
							ВыборкаРезерв = Рез.Выбрать();
							Пока ВыборкаРезерв.Следующий() Цикл
								РезервыПорцииЗаказов.Добавить(ВыборкаРезерв.ДокСсылка);
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
					КоличествоРезервыПорцииЗаказов = РезервыПорцииЗаказов.Количество();
					Если КоличествоРезервыПорцииЗаказов = 0 Тогда
						дОбъектРезерв = Документы.РезервированиеЗаказовПокупателя.СоздатьДокумент();
					Иначе
						Для Индекс = 0 по РезервыПорцииЗаказов.ВГраница() Цикл 
							Если Индекс = РезервыПорцииЗаказов.ВГраница() Тогда
								дОбъектРезерв = РезервыПорцииЗаказов[Индекс].ПолучитьОбъект();
								Если дОбъектРезерв.Проведен Тогда
									дОбъектРезерв.Записать(РежимЗаписиДокумента.ОтменаПроведения);
								ИначеЕсли дОбъектРезерв.ПометкаУдаления Тогда
									дОбъектРезерв.УстановитьПометкуУдаления(Ложь);
								КонецЕсли;
							Иначе
								Если НЕ РезервыПорцииЗаказов[Индекс].ПометкаУдаления Тогда
									дОбъектРезерв = РезервыПорцииЗаказов[Индекс].ПолучитьОбъект();
									дОбъектРезерв.УстановитьПометкуУдаления(Истина);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					дОбъектРезерв.Заполнить(ПорцияЗаказов);	
					дОбъектРезерв.Дата = ТекущаяДатаСеанса();
					Если дОбъектРезерв.ЭтоНовый() Тогда
						дОбъектРезерв.УстановитьНовыйНомер();
					КонецЕсли;
					
					ОбработкаТабличнойЧастиСервер.СортироватьТЧ(дОбъектРезерв.Товары);
					
					НачатьТранзакцию();
					
					Блокировка = Новый БлокировкаДанных;
					ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТоваров");
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
					ЭлементБлокировки.УстановитьЗначение("Склад",дОбъектРезерв.СкладКомпании);
					ЭлементБлокировки.ИсточникДанных  =  дОбъектРезерв.Товары;
					ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
					ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика","ХарактеристикаНоменклатуры");
					Блокировка.Заблокировать();
					
					Документы.РезервированиеЗаказовПокупателя.УдалитьСтрокиБезОстатка(дОбъектРезерв);
					Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
					Документы.РезервированиеЗаказовПокупателя.ЗаполнитьХарактеристикиПоОстаткамПартий(дОбъектРезерв);
					//Проверим квоты после заполнения характеристик, может быть еще уменьшено кол-во
					Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
					
					Если дОбъектРезерв.Товары.Количество() = 0 Тогда
						ОтменитьТранзакцию();
						Возврат;
					КонецЕсли;		
					
					//тзЗаказыПокупателей = дОбъектРезерв.Товары.Выгрузить(,"ЗаказПокупателя");//.Скопировать(,"ЗаказПокупателя");
					//тзЗаказыПокупателей.Свернуть("ЗаказПокупателя");
					//Для Каждого СтрЗаказ Из тзЗаказыПокупателей Цикл
					//	стр = дОбъектРезерв.РаспределениеОтгрузки.Добавить();
					//	ЗаполнитьЗначенияСвойств(стр,СтрЗаказ);
					//КонецЦикла;
					
					дОбъектРезерв.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
					
					
					ЗафиксироватьТранзакцию();
					
					
					
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РезервироватьСтрокуСписка(СтрокаСписка)
	
	
	
	// проверка на отгрузку
	Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрокаСписка,?(ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(СтрокаСписка.Контрагент),"ПеремещениеТоваров","РеализацияТоваров"));
	Рез = Запрос.Выполнить();
	
	Если Не Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		Если Выборка.Проведен Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	
	Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрокаСписка,"РезервированиеЗаказовПокупателя");
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		дОбъектРезерв = Документы.РезервированиеЗаказовПокупателя.СоздатьДокумент();
	Иначе
		ВыборкаРезерв = Рез.Выбрать();
		ВыборкаРезерв.Следующий();
		дОбъектРезерв = ВыборкаРезерв.ДокСсылка.ПолучитьОбъект();
		Если ВыборкаРезерв.Проведен Тогда
			дОбъектРезерв.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли ВыборкаРезерв.ПометкаУдаления Тогда
			дОбъектРезерв.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	дОбъектРезерв.Заполнить(СтрокаСписка);	
	дОбъектРезерв.Дата = ТекущаяДатаСеанса();
	Если дОбъектРезерв.ЭтоНовый() Тогда
		дОбъектРезерв.УстановитьНовыйНомер();
	КонецЕсли;
	
	
	ОбработкаТабличнойЧастиСервер.СортироватьТЧ(дОбъектРезерв.Товары);
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад",дОбъектРезерв.СкладКомпании);
	ЭлементБлокировки.ИсточникДанных  =  дОбъектРезерв.Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();
	
	Документы.РезервированиеЗаказовПокупателя.УдалитьСтрокиБезОстатка(дОбъектРезерв);
	Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
	Документы.РезервированиеЗаказовПокупателя.ЗаполнитьХарактеристикиПоОстаткамПартий(дОбъектРезерв);
	//Проверим квоты после заполнения характеристик, может быть еще уменьшено кол-во
	Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
	
	
	Если дОбъектРезерв.Товары.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;		
	
	
	дОбъектРезерв.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный); 
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Функция ПереместитьПодОтгрузку(Заказ)
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезервыТоваров.Заказ КАК ДокументОснование,
	|	РезервыТоваров.Заказ.РегламентированныйУчет КАК РегламентированныйУчет,
	|	РезервыТоваров.Заказ.Организация КАК Организация,
	|	РезервыТоваров.Заказ.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	РезервыТоваров.Заказ.СкладКомпании КАК СкладКомпанииПолучатель,
	|	РезервыТоваров.Заказ.ТорговаяПлощадка КАК ТорговаяПлощадкаПолучатель,
	|	РезервыТоваров.Заказ.ВалютаДокумента КАК ВалютаДокумента,
	|	РезервыТоваров.Заказ.КурсДокумента КАК КурсДокумента,
	|	РезервыТоваров.Регистратор КАК Регистратор,
	|	РезервыТоваров.Склад КАК СкладКомпании,
	|	РезервыТоваров.Склад.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	РезервыТоваров.Склад.ТипЦенСебестоимости КАК ТипЦен,
	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваров) КАК ХозОперация,
	|	РезервыТоваров.Номенклатура КАК Номенклатура,
	|	РезервыТоваров.Характеристика КАК Характеристика,
	|	РезервыТоваров.Резерв КАК Резерв
	|ИЗ
	|	РегистрНакопления.РезервыТоваров КАК РезервыТоваров
	|ГДЕ
	|	РезервыТоваров.Регистратор ССЫЛКА Документ.РезервированиеЗаказовПокупателя
	|	И РезервыТоваров.Заказ = &Заказ
	|	И РезервыТоваров.Склад <> ВЫРАЗИТЬ(РезервыТоваров.Регистратор КАК Документ.РезервированиеЗаказовПокупателя).СкладКомпании
	|ИТОГИ
	|	МАКСИМУМ(Регистратор),
	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваров) КАК ХозОперация
	|ПО
	|	ДокументОснование,
	|	СкладКомпании";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказ.Следующий() Цикл
		
		ВыборкаМестоРазмещения = ВыборкаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМестоРазмещения.Следующий() Цикл
			ОбъектПР = Документы.ПеремещениеТоваров.СоздатьДокумент();
			ОбъектПР.ДополнительныеСвойства.Вставить("НеКонтролироватьОстатки", Истина);
			ОбъектПР.Дата = ТекущаяДатаСеанса();
			ЗаполнитьЗначенияСвойств(ОбъектПР, ВыборкаМестоРазмещения);
			ОбъектПР.УстановитьНовыйНомер();
			ОбъектПР.Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 Перемещение товара под %2'; uk = '%1 Переміщення товару під %5'"),
			ТекущаяДата(),
			ВыборкаМестоРазмещения.Регистратор);
			ОбъектПР.ЗакрытиеЗаказовПокупателей = 2;
			
			ВыборкаДетальныеЗаписи = ВыборкаМестоРазмещения.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрока = ОбъектПР.Товары.Добавить();
				НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = ВыборкаДетальныеЗаписи.Характеристика;
				НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Резерв;
			КонецЦикла;
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
			СтруктураДействий.Вставить("ЗаполнитьЦены", Новый Структура("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ОбъектПР)));//РеквизитыОснование.Ссылка)));
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
			//СтруктураДействий.Вставить("ЦеныБезХарактеристики", Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ОбъектПР.СкладКомпанииПолучатель, ОбъектПР.Дата));		
			
			
			ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ОбъектПР.Товары, СтруктураДействий, Неопределено);
			//ОбъектПР.СуммаДокумента = ОбъектПР.Товары.Итог("СуммаВсего");			
			
			
			ОбъектПР.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	Возврат Неопределено
	
КонецФункции

&НаСервере
Процедура ОтгрузитьЗаказ(СтрокаСписка)
	НачатьТранзакцию();
	
	ПеремещениеНаСкладОтгрузки = ПереместитьПодОтгрузку(СтрокаСписка);
	
	ТипДокументаОтгрузки = ?(ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(СтрокаСписка.Контрагент),"ПеремещениеТоваров","РеализацияТоваров");
	Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрокаСписка,ТипДокументаОтгрузки);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		дОбъект = Документы[ТипДокументаОтгрузки].СоздатьДокумент();
	Иначе
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		дОбъект = Выборка.ДокСсылка.ПолучитьОбъект();
		Если Выборка.Проведен Тогда
			дОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Выборка.ПометкаУдаления Тогда
			дОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	дОбъект.Заполнить(СтрокаСписка);	
	дОбъект.Дата = ТекущаяДатаСеанса();
	Если дОбъект.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если дОбъект.ЭтоНовый() Тогда
		дОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	Если дОбъект.ДополнительныеСвойства.Свойство("ОшибкаПоВоде") Тогда
		ОбщегоНазначения.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1%2%3%4Ошибка по воде: %5'; uk = '%1%2%3%4Помилка по воді: %5'"),
		СтрокаСписка,
		Символы.ПС,
		дОбъект.СкладКомпанииПолучатель,
		Символы.ПС,
		дОбъект.ДополнительныеСвойства.ОшибкаПоВоде));
	КонецЕсли;
	
	Если дОбъект.ПроверитьЗаполнение() Тогда
		дОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный); 
	КонецЕсли;
	
	Если ТипДокументаОтгрузки = "ПеремещениеТоваров" И дОбъект.Проведен Тогда 
		ПеремещениеПриход = Документы.ПеремещениеТоваров.СоздатьДокумент();
		ПеремещениеПриход.Заполнить(дОбъект.Ссылка);
		ПеремещениеПриход.Дата = дОбъект.Дата + 1;
		
		ПеремещениеПриход.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Если дОбъект.Проведен Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьВидимостьЭлементовФормы(Форма,Порядок)
	
	
	//Форма.Элементы.ГруппаКнопокСписок.Видимость = (Порядок = 1 ИЛИ Порядок = 2 ИЛИ Порядок = 3);
	Форма.Элементы.ГруппаКнопокСписок.Видимость = Порядок = 1;
	Форма.Элементы.ГруппаКнопокОтгрузить.Видимость = Порядок = 3;
	Форма.Элементы.ГруппаКнопокТТН.Видимость = Порядок = 2;
	Форма.Элементы.ГруппаОтменить.Видимость = (Порядок = 1 ИЛИ Порядок = 2 ИЛИ Порядок = 3);
	
КонецПроцедуры



&НаКлиенте
Процедура СписокСтатусовПриАктивизацииСтроки(Элемент)
	
	
	ИспользованиеФильтра = Ложь;
	ИспользованиеФильтраТТН = Ложь;
	
	ВидСравненияФильтра = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияФильтраТТН = ВидСравненияКомпоновкиДанных.Равно;
	
	ЗначениеФильтра = 0;
	//	ЗначениеФильтраТТН = 2;
	ТекДанные = Элемент.ТекущиеДанные;
	СохраненныйСтатус = Элемент.ТекущаяСтрока;
	
	Элементы.ВыделеноЗаказано.Видимость = ТекДанные.Статус = "Необработанные";
	Элементы.ВыделеноЗарезервировано.Видимость = ТекДанные.Статус <> "Необработанные";
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.Статус = "Не в ТТН" Тогда
			ИспользованиеФильтраТТН = Истина;
			
		ИначеЕсли ТекДанные.Статус <> "Все" Тогда
			ИспользованиеФильтра = Истина;
			ЗначениеФильтра = ТекДанные.Порядок;
		КонецЕсли;
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СтатусПорядок", ЗначениеФильтра, ВидСравненияФильтра,, ИспользованиеФильтра);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПорядокТТН", 2, ВидСравненияФильтраТТН,, ИспользованиеФильтраТТН);
	
	ИзменитьВидимостьЭлементовФормы(ЭтаФорма,ТекДанные.Порядок);
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуСписка()
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТаблицаРезультат;
	
КонецФункции


&НаСервере
Процедура РезервироватьВсеНаСервере()
	
	ИспользоватьОбъединениеРезервированиеЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьОбъединениеРезервированиеЗаказов");
	
	ТаблицаРезультат = ПолучитьТаблицуСписка();
	
	Если ТаблицаРезультат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьОбъединениеРезервированиеЗаказов Тогда
		РезервироватьМассивСписка(ТаблицаРезультат.ВыгрузитьКолонку("ССылка"));	
	Иначе
		для Каждого СтрЗаказ Из ТаблицаРезультат Цикл 
			РезервироватьСтрокуСписка(СтрЗаказ.Ссылка);	
		КонецЦикла;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура РезервироватьВсе(Команда)
	РезервироватьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура РезервироватьВыделенноеНаСервере()
	
	ИспользоватьОбъединениеРезервированиеЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьОбъединениеРезервированиеЗаказов");
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьОбъединениеРезервированиеЗаказов Тогда
		РезервироватьМассивСписка(МассивСтрок);	
	Иначе
		для Каждого  СтрЗаказ Из МассивСтрок Цикл 
			РезервироватьСтрокуСписка(СтрЗаказ);	
		КонецЦикла;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура РезервироватьВыделенное(Команда)
	РезервироватьВыделенноеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтгрузитьВсеНаСервере()
	
	ТаблицаРезультат = ПолучитьТаблицуСписка();
	Если ТаблицаРезультат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	для Каждого СтрЗаказ Из ТаблицаРезультат Цикл 
		ОтгрузитьЗаказ(СтрЗаказ.Ссылка);	
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузитьВсе(Команда)
	ЗадатьВопрос("Отгрузить", "Все");
	//	ОтгрузитьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтгрузитьВыделенноеНаСервере()
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	для Каждого СтрЗаказ Из МассивСтрок Цикл 
		ОтгрузитьЗаказ(СтрЗаказ);	
	КонецЦикла;
	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузитьВыделенное(Команда)
	ЗадатьВопрос("Отгрузить", "Выделенное");
	//ОтгрузитьВыделенноеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьТТНВсеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТТНВсе(Команда)
	СоздатьТТНВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьТТНВыделенноеНаСервере(Маршрут,Организация)
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из МассивСтрок Цикл 
		Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ.Ссылка,"РезервированиеЗаказовПокупателя");
		
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Продолжить;
		Иначе
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ДокСсылка = Выборка.ДокСсылка;
			Если ДокСсылка.Проведен Тогда
				МассивДокументов.Добавить(ДокСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ДокТТН = Документы.ТК_ТТН.СоздатьДокумент();
	ДокТТН.Заполнить(Неопределено);
	
	ДокТТН.Организация = Организация;	
	Если ЗначениеЗаполнено(Организация) Тогда
		ДокТТН.Заказчик = Организация.Контрагент;
		ДокТТН.Отправитель = Организация.Контрагент.НаименованиеПолное;
	КонецЕсли;
	
	МаршрутРазвозки = Справочники.Маршруты.НайтиПоКоду(Маршрут);
	
	Если ЗначениеЗаполнено(МаршрутРазвозки) Тогда
		ДокТТН.Автомобиль = МаршрутРазвозки.Автомобиль;	
		ДокТТН.Водитель = МаршрутРазвозки.Автомобиль.Водитель;	
		ДокТТН.Экспедитор = МаршрутРазвозки.Экспедитор;	
	КонецЕсли;
	
	//ДокТТН.УстановитьНовыйНомер();
	ДокТТН.Дата = ТекущаяДатаСеанса();
	ДокТТН.Перевозчик = Справочники.Контрагенты.НайтиПоКоду("43648497");	//	Торонто Компани ООО
	// Вставить содержимое обработчика.
	
	Для Каждого стрРезерв Из МассивДокументов Цикл 
		СтруктураТекСтрока = Новый Структура("НомерСтроки,Документ,Масса");
		
		НоваяСторокаДокумент = ДокТТН.Источники.Добавить();
		НоваяСторокаДокумент.Документ = стрРезерв;
		
		ЗаполнитьЗначенияСвойств(СтруктураТекСтрока,НоваяСторокаДокумент);
		
		
		Документы.ТК_ТТН.ЗаполнитьРеквизитыТабличнойЧасти(ДокТТН.Источники,СтруктураТекСтрока);
		
		
	КонецЦикла;
	
	ДокТТН.Записать();
	
	Элементы.Список.Обновить();
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТТНВыделенное(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СоздатьТТНВыделенноеНаСервере(ТекущиеДанные.Маршрут,ТекущиеДанные.Организация);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьВТТННаСервере(ДокСсылка,МассивДокументов)
	
	НачатьТранзакцию();
	Блокировка = Новый БлокировкаДанных;
	ЭлементыБлокировки = Блокировка.Добавить("Документ.ТК_ТТН");
	ЭлементыБлокировки.УстановитьЗначение("Ссылка",ДокСсылка);
	ЭлементыБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	
	Для Каждого  ДокОтгрузки  Из МассивДокументов.МассивСтрок Цикл 
		
		
		Запрос = ЗапросНайтиПодчиненныйПоТипу(ДокОтгрузки,"РезервированиеЗаказовПокупателя");
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Продолжить;
		Иначе
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			Если НЕ Выборка.Проведен Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураТекСтрока = Новый Структура("НомерСтроки,Документ,Масса");
			
			НоваяСторокаДокумент = ДокОбъект.Источники.Добавить();
			НоваяСторокаДокумент.Документ = Выборка.ДокСсылка;
			
			
			
			ЗаполнитьЗначенияСвойств(СтруктураТекСтрока,НоваяСторокаДокумент);
			
			
			Документы.ТК_ТТН.ЗаполнитьРеквизитыТабличнойЧасти(ДокОбъект.Источники,СтруктураТекСтрока);
			
			
			
			ЗапросДокОтгрузки = ЗапросНайтиПодчиненныйПоТипу(ДокОтгрузки,"ПеремещениеТоваров");
			РезДокОтгрузки = ЗапросДокОтгрузки.Выполнить();
			Если Не РезДокОтгрузки.Пустой() Тогда
				ВыборкаДокОтгрузки = РезДокОтгрузки.Выбрать();
				Пока ВыборкаДокОтгрузки.Следующий() Цикл ;
					Если ВыборкаДокОтгрузки.ПометкаУдаления Тогда
						Продолжить;
					КонецЕсли;
					НоваяСторокаДокумент.Отгрузка = ВыборкаДокОтгрузки.ДокСсылка;
				КонецЦикла;
			Иначе
				ЗапросДокОтгрузки = ЗапросНайтиПодчиненныйПоТипу(ДокОтгрузки,"РеализацияТоваров");
				РезДокОтгрузки = ЗапросДокОтгрузки.Выполнить();
				Если Не РезДокОтгрузки.Пустой() Тогда
					ВыборкаДокОтгрузки = РезДокОтгрузки.Выбрать();
					ВыборкаДокОтгрузки.Следующий();
					НоваяСторокаДокумент.Отгрузка = ВыборкаДокОтгрузки.ДокСсылка;	
				КонецЕсли;
				
			КонецЕсли;
			
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДокОбъект.Записать();
	ЗафиксироватьТранзакцию();
	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВТТН(Команда)
	
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	Оп = Новый ОписаниеОповещения("ВыборТТНЗакрытие", ЭтотОбъект,Новый Структура("МассивСтрок",МассивСтрок));
	ОткрытьФорму("Документ.ТК_ТТН.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТТНЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВТТННаСервере(Результат, ДополнительныеПараметры);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	
КонецПроцедуры


&НаСервере
Функция  ПечатьРезервВыделенноеНаСервере()
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	МассивДокументов = Новый Массив;
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат МассивДокументов;
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	
	для Каждого СтрЗаказ Из МассивСтрок Цикл 
		Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ,"РезервированиеЗаказовПокупателя");
		
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Продолжить;
		Иначе
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ДокСсылка = Выборка.ДокСсылка;
			Если ДокСсылка.Проведен Тогда
				МассивДокументов.Добавить(ДокСсылка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат  МассивДокументов
	
КонецФункции

&НаСервере
Функция ПечатьРезервВсеНаСервере()
	
	МассивДокументов = Новый Массив;
	
	ТаблицаРезультат = ПолучитьТаблицуСписка();
	Если ТаблицаРезультат.Количество() = 0 Тогда
		Возврат МассивДокументов;
	КонецЕсли;
	
	
	для Каждого СтрЗаказ Из ТаблицаРезультат Цикл 
		
		Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ.Ссылка,"РезервированиеЗаказовПокупателя");
		
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Продолжить;
		Иначе
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ДокСсылка = Выборка.ДокСсылка;
			Если ДокСсылка.Проведен Тогда
				МассивДокументов.Добавить(ДокСсылка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат  МассивДокументов
	
КонецФункции

&НаКлиенте
Процедура ПечатьРезервов(ВидПечати = "")
	
	Если ВидПечати = "Все" Тогда 
		МассивДокументов = ПечатьРезервВсеНаСервере()
	Иначе
		МассивДокументов = ПечатьРезервВыделенноеНаСервере();
	КонецЕсли;
	
	Если МассивДокументов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Печать_ПФ_Резервирование) Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана печатная форма для документа ""Резервирование заказов покупателей""'; uk = 'Не обрана печатна форма для документу ""Резервування замовлень покупців""'"));
		Возврат;
	КонецЕсли;
	
	Если Печать_ВыводитьНаПринтер Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.РезервированиеЗаказовПокупателя", Печать_ПФ_Резервирование, МассивДокументов, Новый Структура("Порядок", "Сигареты"));
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РезервированиеЗаказовПокупателя", Печать_ПФ_Резервирование, МассивДокументов, ЭтаФорма, Новый Структура("Порядок", "Сигареты"));
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьРезервВыделенное(Команда)
	
	ПечатьРезервов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРезервВсе(Команда)
	
	ПечатьРезервов("Все");
	
КонецПроцедуры


&НаСервере
Функция ПечатьОтгрузкиВсеНаСервере()
	
	СтруктураПечати = Новый Массив;
	
	ТаблицаРезультат = ПолучитьТаблицуСписка();
	Если ТаблицаРезультат.Количество() = 0 Тогда
		Возврат СтруктураПечати;
	КонецЕсли;
	
	
	МассивДокументовРеализация  = Новый Массив;
	МассивДокументовПеремещение = Новый Массив;
	для Каждого СтрЗаказ Из ТаблицаРезультат Цикл 
		
		
		
		ЗапросДокОтгрузки = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ.Ссылка,"ПеремещениеТоваров");
		РезДокОтгрузки = ЗапросДокОтгрузки.Выполнить();
		Если Не РезДокОтгрузки.Пустой() Тогда
			ВыборкаДокОтгрузки = РезДокОтгрузки.Выбрать();
			ВыборкаДокОтгрузки.Следующий();
			МассивДокументовПеремещение.Добавить(ВыборкаДокОтгрузки.ДокСсылка);	
		Иначе
			ЗапросДокОтгрузки = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ.Ссылка,"РеализацияТоваров");
			РезДокОтгрузки = ЗапросДокОтгрузки.Выполнить();
			Если Не РезДокОтгрузки.Пустой() Тогда
				ВыборкаДокОтгрузки = РезДокОтгрузки.Выбрать();
				ВыборкаДокОтгрузки.Следующий();
				МассивДокументовРеализация.Добавить(ВыборкаДокОтгрузки.ДокСсылка);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивДокументовРеализация.Количество() > 0 Тогда
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","РеализацияТоваров", Печать_ПФ_Реализация, МассивДокументовРеализация));
	КонецЕсли;
	
	Если МассивДокументовПеремещение.Количество() > 0 Тогда
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","ПеремещениеТоваров", Печать_ПФ_Перемещение, МассивДокументовПеремещение));
	КонецЕсли;
	
	
	Возврат  СтруктураПечати;
	
	
	
КонецФункции

&НаСервере
Функция ПечатьОтгрузкиВыделенноеНаСервере()
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	СтруктураПечати = Новый Массив;
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат СтруктураПечати;
	КонецЕсли;
	
	МассивДокументовРеализация  = Новый Массив;
	МассивДокументовПеремещение = Новый Массив;
	
	
	
	Для Каждого СтрЗаказ Из МассивСтрок Цикл 
		
		ЗапросДокОтгрузки = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ,"ПеремещениеТоваров");
		РезДокОтгрузки = ЗапросДокОтгрузки.Выполнить();
		Если Не РезДокОтгрузки.Пустой() Тогда
			ВыборкаДокОтгрузки = РезДокОтгрузки.Выбрать();
			ВыборкаДокОтгрузки.Следующий();
			МассивДокументовПеремещение.Добавить(ВыборкаДокОтгрузки.ДокСсылка);	
		Иначе
			ЗапросДокОтгрузки = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ,"РеализацияТоваров");
			РезДокОтгрузки = ЗапросДокОтгрузки.Выполнить();
			Если Не РезДокОтгрузки.Пустой() Тогда
				ВыборкаДокОтгрузки = РезДокОтгрузки.Выбрать();
				ВыборкаДокОтгрузки.Следующий();
				МассивДокументовРеализация.Добавить(ВыборкаДокОтгрузки.ДокСсылка);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если МассивДокументовРеализация.Количество() > 0 Тогда
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","РеализацияТоваров", Печать_ПФ_Реализация, МассивДокументовРеализация));
	КонецЕсли;
	
	Если МассивДокументовПеремещение.Количество() > 0 Тогда
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","ПеремещениеТоваров", Печать_ПФ_Перемещение, МассивДокументовПеремещение));
	КонецЕсли;
	
	
	Возврат  СтруктураПечати;
	
	
КонецФункции

&НаКлиенте
Процедура ПечатьОтгрузки(ВидПечати = "")
	
	Если ВидПечати = "Все" Тогда 
		СтруктураПечати = ПечатьОтгрузкиВсеНаСервере();
	Иначе
		СтруктураПечати = ПечатьОтгрузкиВыделенноеНаСервере();
	КонецЕсли;
	
	Если СтруктураПечати.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ТипДокумента Из СтруктураПечати Цикл 		
		Если Не ЗначениеЗаполнено(ТипДокумента.ФормаПечати) Тогда 
			ПоказатьПредупреждение(, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не выбрана печатная форма для документа ""%1""'; uk = 'Не обрана печатна форма для документу ""%1""'"),
			ТипДокумента.Документ));
			Продолжить;
		КонецЕсли;
		
		Если Печать_ВыводитьНаПринтер Тогда 
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ."+ТипДокумента.Документ, ТипДокумента.ФормаПечати, ТипДокумента.МассивДокументов);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ."+ТипДокумента.Документ,ТипДокумента.ФормаПечати,ТипДокумента.МассивДокументов,ЭтаФорма);
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтгрузкиФС(ВидПечати = "")
	
	Если ВидПечати = "Все" Тогда 
		СтруктураПечати = ПечатьОтгрузкиВсеНаСервереФС();
	Иначе
		СтруктураПечати = ПечатьОтгрузкиВыделенноеНаСервереФС();
	КонецЕсли;
	
	Если СтруктураПечати.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ТипДокумента Из СтруктураПечати Цикл 		
		Если Не ЗначениеЗаполнено(ТипДокумента.ФормаПечати) Тогда 
			ПоказатьПредупреждение(, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не выбрана печатная форма для документа ""%1""'; uk = 'Не обрана печатна форма для документу ""%1""'"),
			ТипДокумента.Документ));
			Продолжить;
		КонецЕсли;
		
		Если Печать_ВыводитьНаПринтер Тогда 
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ."+ТипДокумента.Документ, ТипДокумента.ФормаПечати, ТипДокумента.МассивДокументов);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ."+ТипДокумента.Документ,ТипДокумента.ФормаПечати,ТипДокумента.МассивДокументов,ЭтаФорма);
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция ПечатьОтгрузкиВсеНаСервереФС()
	
	СтруктураПечати = Новый Массив;
	
	ТаблицаРезультат = ПолучитьТаблицуСписка();
	Если ТаблицаРезультат.Количество() = 0 Тогда
		Возврат СтруктураПечати;
	КонецЕсли;
	
	МассивДокументовРеализация  = Новый Массив;
	для Каждого СтрЗаказ Из ТаблицаРезультат Цикл 
		
		ЗапросДокОтгрузки = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ.Ссылка,"РеализацияТоваров");
		РезДокОтгрузки = ЗапросДокОтгрузки.Выполнить();
		Если Не РезДокОтгрузки.Пустой() Тогда
			ВыборкаДокОтгрузки = РезДокОтгрузки.Выбрать();
			ВыборкаДокОтгрузки.Следующий();
			МассивДокументовРеализация.Добавить(ВыборкаДокОтгрузки.ДокСсылка);	
		КонецЕсли;
		
	КонецЦикла;
	
	тПечать_ПФ_Реализация_ФС = Печать_ПФ_Реализация_ФС+","+Печать_ПФ_Реализация_ФС+","+Печать_ПФ_Реализация_ФС+","+Печать_ПФ_Реализация_ФС;
	тПечать_ПФ_ТТН_ФС = Печать_ПФ_ТТН_ФС+","+Печать_ПФ_ТТН_ФС;
	
	Если МассивДокументовРеализация.Количество() > 0 Тогда
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","РеализацияТоваров", тПечать_ПФ_Реализация_ФС, МассивДокументовРеализация));
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","РеализацияТоваров", Печать_ПФ_Декларация_ФС,  МассивДокументовРеализация));
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","РеализацияТоваров", тПечать_ПФ_ТТН_ФС, 	    МассивДокументовРеализация));
	КонецЕсли;
	
	Возврат  СтруктураПечати;
	
КонецФункции

&НаСервере
Функция ПечатьОтгрузкиВыделенноеНаСервереФС()
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	СтруктураПечати = Новый Массив;
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат СтруктураПечати;
	КонецЕсли;
	
	МассивДокументовРеализация  = Новый Массив;
	
	Для Каждого СтрЗаказ Из МассивСтрок Цикл 
		
		ЗапросДокОтгрузки = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ,"РеализацияТоваров");
		РезДокОтгрузки = ЗапросДокОтгрузки.Выполнить();
		Если Не РезДокОтгрузки.Пустой() Тогда
			ВыборкаДокОтгрузки = РезДокОтгрузки.Выбрать();
			ВыборкаДокОтгрузки.Следующий();
			МассивДокументовРеализация.Добавить(ВыборкаДокОтгрузки.ДокСсылка);	
		КонецЕсли;
		
	КонецЦикла;
	
	тПечать_ПФ_Реализация_ФС = Печать_ПФ_Реализация_ФС+","+Печать_ПФ_Реализация_ФС+","+Печать_ПФ_Реализация_ФС+","+Печать_ПФ_Реализация_ФС;
	тПечать_ПФ_ТТН_ФС = Печать_ПФ_ТТН_ФС+","+Печать_ПФ_ТТН_ФС;
	
	Если МассивДокументовРеализация.Количество() > 0 Тогда
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","РеализацияТоваров", тПечать_ПФ_Реализация_ФС, МассивДокументовРеализация));
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","РеализацияТоваров", Печать_ПФ_Декларация_ФС,  МассивДокументовРеализация));
		СтруктураПечати.Добавить(Новый Структура("Документ,ФормаПечати,МассивДокументов","РеализацияТоваров", тПечать_ПФ_ТТН_ФС, 	    МассивДокументовРеализация));
	КонецЕсли;
	
	Возврат  СтруктураПечати;
	
	
КонецФункции


&НаКлиенте
Процедура ПечатьОтгрузкиВсе(Команда)
	
	ПечатьОтгрузки("Все");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтгрузкиВыделенное(Команда)
	
	ПечатьОтгрузки();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	а = 1;
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВыделенныеСтроки() 
	
	Выделено = Элементы.Список.ВыделенныеСтроки;
	ВыделеноКоличество = Выделено.Количество();
	
	ВыделеноЗаказано = 0;
	ВыделеноЗарезервировано = 0;
	Для Каждого Ид Из Выделено Цикл 
		ТекСтрока = Элементы.Список.ДанныеСтроки(Ид);
		ВыделеноЗаказано = ВыделеноЗаказано + ТекСтрока.КвоЗаказано;
		ВыделеноЗарезервировано = ВыделеноЗарезервировано + ТекСтрока.КвоЗарезервировано;
	КонецЦикла;	
	
КонецПроцедуры


&НаСервере
Процедура ОтменитьЗаказ(ЗаказПокупателя)
	
	Запрос = ЗапросНайтиПодчиненныйПоТипу(ЗаказПокупателя, "КорректировкаЗаказаПокупателя");
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		ДокОтмена = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	Иначе
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		ДокОтмена = Выборка.ДокСсылка.ПолучитьОбъект();
		
		Если Выборка.Проведен Тогда
			ДокОтмена.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Выборка.ПометкаУдаления Тогда
			ДокОтмена.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ДокОтмена.Заполнить(ЗаказПокупателя);		
	
	Если ДокОтмена.ЭтоНовый() Тогда
		ДокОтмена.УстановитьНовыйНомер();
	КонецЕсли;
	
	Если ДокОтмена.ПроверитьЗаполнение() Тогда 
		Попытка
			ДокОтмена.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось проверсти корректировку по заказу ""%1"".
			|Ошибки: %2'; uk = 'Не вдалося провести корегування по замовленню ""%1"".
			|Помилки: %2'"),
			ЗаказПокупателя,
			ОписаниеОшибки()),
			ЗаказПокупателя);
		КонецПопытки;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось проверсти корректировку по заказу ""%1"".'; uk = 'Не вдалося провести корегування по замовленню ""%1"".'"),
		ЗаказПокупателя),
		ЗаказПокупателя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбрабоатьОтменуЗаказовНаСервере(ВидОтмены)
	
	Если ВидОтмены = "Все" Тогда 
		СтрокиОтмены = ПолучитьТаблицуСписка();
	ИначеЕсли ВидОтмены = "Выделенное" Тогда 
		СтрокиОтмены = Элементы.Список.ВыделенныеСтроки;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если СтрокиОтмены.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ТипЗаказ = Тип("ДокументСсылка.ЗаказПокупателя");
	
	Для Каждого СтрЗаказ Из СтрокиОтмены Цикл 
		Если ТипЗнч(СтрЗаказ) = ТипЗаказ Тогда 
			ОтменитьЗаказ(СтрЗаказ);
		Иначе			
			ОтменитьЗаказ(СтрЗаказ.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	ЗадатьВопрос("Отменить", "Все");
	//ОбрабоатьОтменуЗаказовНаСервере("Все");
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьВыделенное(Команда)
	ЗадатьВопрос("Отменить", "Выделенное");
	//ОбрабоатьОтменуЗаказовНаСервере("Выделенное");
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Перем ФормаОтчёта, КомпоновщикНастроек, Период, ПараметрыФормы;
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент  = ПолучитьМакетНаСервере(МассивСтрок);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимОткрытияОкна", РежимОткрытияОкна);
	ПараметрыФормы.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	ПараметрыФормы.Вставить("Редактирование", Истина); 
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыФормы, ЭтаФорма);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(МассивСтрок)
	
	ТабДок = Новый ТабличныйДокумент;
	НовЗаказ = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Документ",НовЗаказ);
	
	Для Каждого Стр Из МассивСтрок Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Документ = Стр;
	КонецЦикла;
	
	СхемаКомпоновкиДанных  = ЖурналыДокументов.ТК_ЗаказыПокупателей.ПолучитьМакет("Макет");
	Настройки  = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый
	ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МассивЗаказы", Таблица);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура УстановитьПриоритет(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОповещениЕ = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтотОбъект, Команда.Имя);
	
	ОткрытьФорму("ЖурналДокументов.ТК_ЗаказыПокупателей.Форма.Форма",ПараметрыФормы,ЭтаФорма,,,,ОповещениЕ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбора(Результат,ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		УстановитьЗначенияНаВыделеные(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияНаВыделеные(Результат)
	
	Статус 	  		  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", Неопределено);
	Приоритет 		  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Приоритет", Неопределено);
	ЗаполнитьКатрочку = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ЗаполнитьКатрочку", Ложь);
	текПользователь = Пользователи.ТекущийПользователь().ФизическоеЛицо;
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НовЗаказ = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Документ",НовЗаказ);
	
	Для Каждого Стр Из МассивСтрок Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Документ = Стр;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗаказов.Документ КАК Документ
	|ПОМЕСТИТЬ ВтЗаказы
	|ИЗ
	|	&ТаблицаЗаказов КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервированиеЗаказовПокупателя.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВтРезервы
	|ИЗ
	|	ВтЗаказы КАК ВтЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезервированиеЗаказовПокупателя КАК РезервированиеЗаказовПокупателя
	|		ПО ВтЗаказы.Документ = РезервированиеЗаказовПокупателя.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка.Ссылка
	|ИЗ
	|	ВтЗаказы КАК ВтЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезервированиеЗаказовПокупателя.РаспределениеОтгрузки КАК РезервированиеЗаказовПокупателяРаспределениеОтгрузки
	|		ПО ВтЗаказы.Документ = РезервированиеЗаказовПокупателяРаспределениеОтгрузки.ЗаказПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТК_ОчередьНаСборкуРезервов.Документ КАК Документ,
	|	ВтРезервы.Ссылка.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ТК_ОчередьНаСборкуРезервов.Приоритет КАК Приоритет,
	|	ТК_ОчередьНаСборкуРезервов.Статус КАК Статус
	|ИЗ
	|	ВтРезервы КАК ВтРезервы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ОчередьНаСборкуРезервов КАК ТК_ОчередьНаСборкуРезервов
	|		ПО ВтРезервы.Ссылка = ТК_ОчередьНаСборкуРезервов.Документ";
	
	Запрос.УстановитьПараметр("ТаблицаЗаказов",Таблица);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаписьВОчереди = РегистрыСведений.ТК_ОчередьНаСборкуРезервов.СоздатьМенеджерЗаписи();
		ЗаписьВОчереди.Документ = ВыборкаДетальныеЗаписи.Документ;
		ЗаписьВОчереди.Прочитать();
		
		Если Статус <> Неопределено Тогда 
			ЗаписьВОчереди.Статус  = Статус;
		КонецЕсли;					
		
		Если Приоритет <> Неопределено Тогда 
			ЗаписьВОчереди.Приоритет  = Приоритет;
		КонецЕсли;
		
		Если ЗаполнитьКатрочку Тогда
			ЗаполнитьЗначенияСвойств(ЗаписьВОчереди, Результат);
		КонецЕсли;
		
		ЗаписьВОчереди.Записать(Истина);
		Если Статус <> Неопределено Тогда 
			СтруктураСостояние = Новый  Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка",Статус,ТекущаяДатаСеанса(),текПользователь,ВыборкаДетальныеЗаписи.ТорговаяПлощадка);
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ВыборкаДетальныеЗаписи.Документ,СтруктураСостояние);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьОтгрузкиФСВсе(Команда)
	ПечатьОтгрузкиФС("Все");
КонецПроцедуры


&НаКлиенте
Процедура ПечатьОтгрузкиФСВыделенное(Команда)
	ПечатьОтгрузкиФС();
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопрос(Действие, Что)
	ТекстВопроса = "Вы точно хотите "+Действие+"?";
	Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект,Новый Структура("Действие, Что", Действие, Что)); 
	ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, Кнопки);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.Действие = "Отгрузить" Тогда
			Если ДополнительныеПараметры.Что = "Все" Тогда
				ОтгрузитьВсеНаСервере();
			ИначеЕсли ДополнительныеПараметры.Что = "Выделенное" Тогда
				ОтгрузитьВыделенноеНаСервере();
			КонецЕсли;	
		ИначеЕсли ДополнительныеПараметры.Действие = "Отменить" Тогда
			ОбрабоатьОтменуЗаказовНаСервере(ДополнительныеПараметры.Что);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
